# THIS FILE IS AUTOMATICALLY GENERATED
# Project: D:\Projects\NS\Firmware\NeruoStim\PSOC6\blinky_led\blinky_led\CE216795_DualCoreBlinky01.cydsn\CE216795_DualCoreBlinky01.cyprj
# Date: Thu, 10 Jun 2021 04:14:29 GMT
#set_units -time ns
create_clock -name {CyILO} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/ilo}]]
create_clock -name {CyClk_LF} -period 31250 -waveform {0 15625} [list [get_pins {ClockBlock/lfclk}]]
create_clock -name {CyFLL} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/fll}]]
create_clock -name {CyClk_HF0} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/hfclk_0}]]
create_clock -name {CyClk_Fast} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/fastclk}]]
create_clock -name {CyClk_Peri} -period 20 -waveform {0 10} [list [get_pins {ClockBlock/periclk}]]
create_generated_clock -name {CyClk_Slow} -source [get_pins {ClockBlock/periclk}] -edges {1 2 3} [list [get_pins {ClockBlock/slowclk}]]
create_clock -name {CyPeriClk_App} -period 20 -waveform {0 10} [list [get_pins {ClockBlock/periclk_App}]]
create_clock -name {CyClk_HF1} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/hfclk_1}]]
create_clock -name {CyClk_HF2} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/hfclk_2}]]
create_clock -name {CyClk_HF3} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/hfclk_3}]]
create_clock -name {CyClk_HF4} -period 10 -waveform {0 5} [list [get_pins {ClockBlock/hfclk_4}]]
create_clock -name {CyIMO} -period 125 -waveform {0 62.5} [list [get_pins {ClockBlock/imo}]]


# Component constraints for D:\Projects\NS\Firmware\NeruoStim\PSOC6\blinky_led\blinky_led\CE216795_DualCoreBlinky01.cydsn\TopDesign\TopDesign.cysch
# Project: D:\Projects\NS\Firmware\NeruoStim\PSOC6\blinky_led\blinky_led\CE216795_DualCoreBlinky01.cydsn\CE216795_DualCoreBlinky01.cyprj
# Date: Thu, 10 Jun 2021 04:14:14 GMT
